// 地图地址
const mapConfig ={
    baseMap:"http://localhost:8090/iserver/services/map-ugcv5-ZhanQumap/rest/maps/%E6%88%98%E5%8C%BA_map"
    // baseMap:"http://localhost:8090/iserver/services/map-China/rest/maps/China_Light"
}
// 物流轨迹数据
const guiji=[
    {
        starPoint:"北京市昌平区城区",
        starLon:"12939512.446783049",
        starLat:"4898898.754750009",
        endPoint:"南京中转中心",
        endLon:"13222344.99398726",
        endLat:"3775942.510207906",
        type:"空运",
        arr:[
            [12939512.446783049,4898898.754750009],
            [13030287.146313991,4689307.541038214],
            [13041551.008989908,4723238.611618508],
            [13003663.420298416,4617329.330210206],
            [13038479.036321975,4389027.624047839],
        ]

    },
    {
        starPoint:"南京中转中心",
        starLon:"13222344.99398726",
        starLat:"3775942.510207906",
        endPoint:"郑州港区转运中心",
        endLon:"12673456.303438839",
        endLat:"4107562.1171396174",
        type:"陆地",
        arr:[
            [13222344.99398726,3775942.510207906],
            [13051715.035096787,3744563.5629779818],
            [13037379.199752938,3792926.74973582],
            [13017923.335749544,3838201.114148551],
            [12977987.802385928,3846432.606018139],
            [12891972.790322838,3951137.274634869],
            [12810033.518776162,3951137.274634869],
            [12721970.450721456,4039615.262728698],
            [12721970.450721456,4039615.255261862],
            [12664627.10934606,4093110.373250346],
            [12646195.273338474,4138373.749562482],
            [12673456.303438839,4107562.1171396174]
        ]

    },
    
]
const storageData=[
    {
        code:"1",
        name:"北京市昌平区城区",
        lon:12939512.446783049,
        lat:4898898.754750009,
        // lon:"116.235029",
        // lat:"40.227955",
        type:"被保障单位",
        capacity:"3000",
        realCapacity:"8000",
        surplusCapacity:"5000",
        address:"北京市昌平区马池口镇下念头村昌流路",
    },
    {
        code:"2",
        name:"南京中转中心",
        lon:13222344.99398726,
        lat:3775942.510207906,
        type:"被保障单位",
        capacity:"4000",
        realCapacity:"8000",
        surplusCapacity:"4000",
        address:"北京市昌平区马池口镇下念头村昌流路",
    },
    {
        code:"3",
        name:"郑州港区转运中心",
        lon:12673456.303438839,
        lat:4107562.1171396174,
        type:"军民融合仓",
        capacity:"3000",
        realCapacity:"8000",
        surplusCapacity:"5000",
        address:"郑港街道华夏大道洞庭湖路中航电动汽车院内",
    },
]
export default {
    guiji,storageData,
    mapConfig
}




