<template>
    <div class="left-chart-three-component">
        <div ref="block-chart" class="chart"></div>
    </div>
</template>

<script>
import HomeAPI from '@/api/modules/home'
const Echarts = require("echarts");
export default {
    name: "LeftChartThreeComponent",
    data() {
        return {
            provinceMapping: {
                '1': '北京',
                '3': '天津',
                '5': '河北',
                '19': '广东',
                '20': '广西',
                '16': '福建',
                '23': '海南',
                '14': '安徽',
                '17': '湖北',
                '18': '湖南',
                '12': '江苏',
                '4': '重庆',
                '15': '浙江',
                '24': '贵州',
                '25': '云南',
                '26': '西藏',
                '8': '辽宁',
                '9': '吉林',
                '10': '黑龙江',
                '11': '内蒙古',
                '7': '河南',
                '6': '山西',
                '21': '江西',
                '22': '四川',
                '2': '上海',
                '13': '山东',
                '27': '陕西',
                '28': '甘肃',
                '29': '青海',
                '30': '宁夏',
                '31': '新疆'
            },
            cityMapping: {
                '72': '朝阳区',
                '51035': '东丽区',
                '2800': '海淀区',
                '2801': '西城区',
                '2802': '东城区',
                '2803': '崇文区',
                '2804': '宣武区',
                '2805': '丰台区',
                '2806': '石景山区',
                '2810': '大兴区',
                '142': '石家庄市',
                '1601': '广州市',
                '1617': '韶关市',
                '1698': '云浮市',
                '1740': '梧州市',
                '1792': '贺州市',
                '1704': '清远市',
                '1690': '肇庆市',
                '1607': '深圳市',
                '1609': '珠海市',
                '1655': '东莞市',
                '1657': '中山市',
                '1659': '江门市',
                '1666': '佛山市',
                '164': '邢台市',
                '1303': '福州市',
                '1329': '莆田市',
                '1370': '宁德市',
                '1643': '惠州市',
                '1650': '汕尾市',
                '1720': '柳州市',
                '1726': '桂林市',
                '3044': '来宾市',
                '1818': '河池市',
                '1672': '阳江市',
                '1677': '湛江市',
                '1684': '茂名市',
                '1715': '南宁市',
                '1749': '防城港市',
                '1761': '玉林市',
                '1753': '钦州市',
                '1806': '百色市',
                '3168': '崇左市',
                '1757': '贵港市',
                '1746': '北海市',
                '1315': '厦门市',
                '1341': '漳州市',
                '1627': '河源市',
                '2121': '海口市',
                '3703': '定安县',
                '3704': '屯昌县',
                '3705': '昌江县',
                '3034': '儋州市',
                '3706': '白沙县',
                '3707': '琼中县',
                '3115': '琼海市',
                '3708': '陵水县',
                '3137': '万宁市',
                '3709': '保亭县',
                '3173': '东方市',
                '3710': '乐东县',
                '3690': '三亚市',
                '3698': '文昌市',
                '3699': '五指山市',
                '3701': '临高县',
                '3702': '澄迈县',
                '1140': '安庆市',
                '1381': '武汉市',
                '1387': '黄石市',
                '1441': '黄冈市',
                '1482': '长沙市',
                '1574': '怀化市',
                '1611': '汕头市',
                '911': '徐州市',
                '919': '连云港市',
                '1180': '宿州市',
                '925': '淮安市',
                '933': '宿迁市',
                '1124': '淮北市',
                '1634': '梅州市',
                '1705': '潮州市',
                '1709': '揭阳市',
                '119': '南川区',
                '48131': '璧山区',
                '48205': '渝北区',
                '48204': '江津区',
                '48203': '北碚区',
                '50953': '沙坪坝区',
                '48206': '长寿区',
                '48202': '巴南区',
                '51027': '高新区',
                '51026': '渝中区',
                '50950': '江北区',
                '50951': '南岸区',
                '50952': '九龙坡区',
                '50995': '綦江区',
                '140': '酉阳县',
                '113': '万州区',
                '128': '黔江区',
                '135': '巫溪县',
                '126': '大足区',
                '114': '涪陵区',
                '123': '潼南区',
                '139': '垫江县',
                '48133': '铜梁区',
                '48132': '荣昌区',
                '904': '南京市',
                '1127': '芜湖市',
                '1151': '黄山市',
                '951': '扬州市',
                '2971': '宣城市',
                '1114': '铜陵市',
                '972': '镇江市',
                '1201': '池州市',
                '978': '常州市',
                '1137': '马鞍山市',
                '1159': '滁州市',
                '2808': '房山区',
                '199': '保定市',
                '2809': '通州区',
                '2812': '顺义区',
                '239': '承德市',
                '248': '秦皇岛市',
                '264': '沧州市',
                '274': '廊坊市',
                '2814': '怀柔区',
                '2816': '密云区',
                '224': '张家口市',
                '2901': '昌平区',
                '2953': '平谷区',
                '3065': '延庆区',
                '2807': '门头沟',
                '50954': '大渡口区',
                '131': '奉节县',
                '51028': '北部新区',
                '132': '开州区',
                '48207': '永川区',
                '133': '云阳县',
                '134': '忠县',
                '136': '巫山县',
                '141': '秀山县',
                '138': '彭水县',
                '4164': '城口县',
                '137': '石柱县',
                '115': '梁平区',
                '130': '丰都县',
                '48201': '合川区',
                '1116': '合肥市',
                '1206': '六安市',
                '1132': '蚌埠市',
                '1121': '淮南市',
                '1174': '亳州市',
                '3711': '三沙市',
                '939': '盐城市',
                '1158': '宁波市',
                '959': '泰州市',
                '1298': '舟山市',
                '2144': '贵阳市',
                '2150': '六盘水市',
                '2155': '遵义市',
                '2169': '铜仁市',
                '2180': '毕节市',
                '2189': '安顺市',
                '2205': '黔东南州',
                '2222': '黔南州',
                '2235': '昆明市',
                '2196': '黔西南州',
                '2247': '曲靖市',
                '2281': '普洱市',
                '2258': '玉溪市',
                '2318': '红河州',
                '2291': '临沧市',
                '2298': '保山市',
                '2336': '楚雄州',
                '2347': '大理州',
                '2270': '昭通市',
                '2332': '西双版纳州',
                '2304': '丽江市',
                '2309': '文山州',
                '2360': '德宏州',
                '2366': '怒江州',
                '4108': '迪庆州',
                '2951': '拉萨市',
                '3129': '山南地区',
                '3144': '日喀则地区',
                '3971': '林芝市',
                '560': '沈阳市',
                '573': '大连市',
                '584': '抚顺市',
                '593': '丹东市',
                '598': '锦州市',
                '589': '本溪市',
                '579': '鞍山市',
                '604': '葫芦岛市',
                '609': '营口市',
                '617': '阜新市',
                '632': '朝阳市',
                '639': '长春市',
                '621': '辽阳市',
                '613': '盘锦市',
                '6858': '铁岭市',
                '644': '吉林市',
                '657': '通化市',
                '651': '四平市',
                '674': '松原市',
                '681': '白城市',
                '664': '白山市',
                '687': '延边朝鲜族自治州',
                '2992': '辽源市',
                '698': '哈尔滨市',
                '712': '齐齐哈尔市',
                '731': '双鸭山市',
                '727': '鹤岗市',
                '737': '鸡西市',
                '742': '大庆市',
                '753': '伊春市',
                '757': '牡丹江市',
                '765': '佳木斯市',
                '776': '黑河市',
                '773': '七台河市',
                '782': '绥化市',
                '793': '大兴安岭地区',
                '812': '赤峰市',
                '848': '呼伦贝尔市',
                '895': '兴安盟',
                '902': '通辽市',
                '412': '郑州市',
                '325': '晋城市',
                '420': '开封市',
                '427': '洛阳市',
                '438': '平顶山市',
                '454': '鹤壁市',
                '458': '新乡市',
                '468': '安阳市',
                '475': '濮阳市',
                '446': '焦作市',
                '482': '许昌市',
                '489': '漯河市',
                '495': '三门峡市',
                '527': '周口市',
                '502': '南阳市',
                '538': '驻马店市',
                '549': '信阳市',
                '2780': '济源市',
                '1396': '襄阳市',
                '1421': '宜昌市',
                '1405': '十堰市',
                '1413': '荆州市',
                '1432': '孝感市',
                '2922': '潜江市',
                '1475': '鄂州市',
                '2980': '天门市',
                '1458': '咸宁市',
                '2983': '仙桃市',
                '1477': '荆门市',
                '1479': '随州市',
                '1488': '株洲市',
                '1501': '衡阳市',
                '1495': '湘潭市',
                '1511': '邵阳市',
                '1530': '常德市',
                '1522': '岳阳市',
                '1540': '张家界市',
                '1544': '郴州市',
                '1555': '益阳市',
                '1560': '永州市',
                '1586': '娄底市',
                '1592': '湘西州',
                '1827': '南昌市',
                '1845': '九江市',
                '1832': '景德镇市',
                '1874': '宜春市',
                '1885': '抚州市',
                '1857': '鹰潭市',
                '1898': '吉安市',
                '1911': '赣州市',
                '1466': '恩施州',
                '3154': '神农架林区',
                '1836': '萍乡市',
                '1861': '上饶市',
                '1842': '新余市',
                '2016': '广安市',
                '2022': '南充市',
                '1954': '泸州市',
                '1213': '杭州市',
                '1250': '湖州市',
                '1243': '嘉兴市',
                '1273': '衢州市',
                '1262': '金华市',
                '1255': '绍兴市',
                '1280': '丽水市',
                '1233': '温州市',
                '1290': '台州市',
                '1960': '绵阳市',
                '1977': '广元市',
                '1950': '攀枝花市',
                '1993': '乐山市',
                '1988': '内江市',
                '2005': '宜宾市',
                '2033': '达州市',
                '2042': '巴中市',
                '2047': '雅安市',
                '2070': '阿坝州',
                '2084': '甘孜州',
                '2103': '凉山州',
                '3107': '那曲地区',
                '3138': '昌都地区',
                '3970': '阿里地区',
                '1930': '成都市',
                '1946': '自贡市',
                '1962': '德阳市',
                '1983': '遂宁市',
                '2058': '眉山市',
                '2065': '资阳市',
                '78': '黄浦区',
                '2813': '徐汇区',
                '2815': '长宁区',
                '988': '苏州市',
                '2817': '静安区',
                '2820': '闸北区',
                '2822': '虹口区',
                '2823': '杨浦区',
                '2824': '宝山区',
                '2825': '闵行区',
                '984': '无锡市',
                '2826': '嘉定区',
                '2830': '浦东新区',
                '965': '南通市',
                '2833': '青浦区',
                '2834': '松江区',
                '2835': '金山区',
                '2837': '奉贤区',
                '2841': '普陀区',
                '2919': '崇明区',
                '1000': '济南市',
                '1016': '淄博市',
                '1058': '莱芜市',
                '1060': '德州市',
                '1081': '聊城市',
                '1090': '滨州市',
                '1112': '泰安市',
                '51046': '武清区',
                '51048': '汉沽区',
                '51049': '大港区',
                '51051': '宝坻区',
                '51052': '宁河区',
                '51041': '蓟州区',
                '51042': '静海区',
                '51044': '滨海新区',
                '258': '唐山市',
                '303': '太原市',
                '309': '大同市',
                '336': '晋中市',
                '318': '阳泉市',
                '330': '朔州市',
                '350': '忻州市',
                '368': '吕梁市',
                '379': '临汾市',
                '3074': '长治市',
                '799': '呼和浩特市',
                '823': '乌兰察布市',
                '1007': '青岛市',
                '1025': '东营市',
                '1032': '潍坊市',
                '835': '锡林郭勒盟',
                '1108': '日照市',
                '2900': '济宁市',
                '148': '邯郸市',
                '805': '包头市',
                '870': '鄂尔多斯市',
                '880': '巴彦淖尔市',
                '1042': '烟台市',
                '1053': '威海市',
                '1022': '枣庄市',
                '1072': '临沂市',
                '1099': '菏泽市',
                '810': '乌海市',
                '51040': '红桥区',
                '51043': '南开区',
                '51045': '西青区',
                '51047': '津南区',
                '51050': '北辰区',
                '891': '阿拉善盟',
                '51036': '和平区',
                '51037': '河北区',
                '51038': '河东区',
                '51039': '河西区',
                '2376': '西安市',
                '2386': '铜川市',
                '2402': '咸阳市',
                '2390': '宝鸡市',
                '2416': '渭南市',
                '2428': '延安市',
                '2442': '汉中市',
                '2454': '榆林市',
                '2468': '商洛市',
                '2476': '安康市',
                '2501': '天水市',
                '2534': '陇南市',
                '2487': '兰州市',
                '2544': '武威市',
                '2509': '嘉峪关市',
                '2518': '平凉市',
                '2573': '临夏州',
                '2549': '张掖市',
                '3080': '定西市',
                '2525': '庆阳市',
                '2556': '酒泉市',
                '2492': '金昌市',
                '2580': '西宁市',
                '2495': '白银市',
                '2564': '甘南州',
                '2585': '海东地区',
                '2592': '海北州',
                '2632': '石嘴山市',
                '3071': '中卫市',
                '2652': '乌鲁木齐市',
                '2637': '吴忠市',
                '2597': '黄南州',
                '2603': '海南州',
                '2654': '克拉玛依市',
                '2605': '果洛州',
                '2686': '喀什地区',
                '2644': '固原市',
                '2656': '石河子市',
                '2612': '玉树州',
                '2658': '吐鲁番地区',
                '2620': '海西州',
                '2662': '哈密地区',
                '2666': '和田地区',
                '2675': '阿克苏地区',
                '2628': '银川市',
                '2699': '克孜勒苏柯尔克孜自治州',
                '2704': '巴音郭楞州',
                '2714': '昌吉州',
                '2727': '伊犁州',
                '2723': '博尔塔拉州',
                '2736': '塔城地区',
                '2744': '阿勒泰地区',
                '4110': '五家渠市',
                '15945': '阿拉尔市',
                '15946': '图木舒克市',
                '53090': '铁门关市',
                '53668': '昆玉市',
                '129': '武隆区',
                '1167': '阜阳市',
                '1332': '泉州市',
                '1362': '龙岩市',
                '517': '商丘市',
                '1352': '南平市',
                '1317': '三明市',
                '275': '衡水市',
                '398': '运城市'
            }
        };
    },
    mounted() {
        this.fetchDatas();
        this.$eventBus.$on('left-chart-three-refresh', () => {
            this.fetchDatas()
        })
    },
    beforeDestroy() {
        this.$eventBus.$off('left-chart-three-refresh')
    },
    methods: {
        fetchDatas() {
            HomeAPI.fetchLeftCityRank({}).then(res => {
                this.renderChart(Echarts.init(this.$refs['block-chart']), res.data);
            }).catch((e) => {
                this.renderChart(Echarts.init(this.$refs['block-chart']), []);
            })
        },
        renderChart(echartRef, datas = []) {
            let _citys = [];
            let _datas = [];
            datas.map(r => {
                if (_citys.length < 5) {
                    _citys.push(this.cityMapping[r.addr_city] || '-');
                    _datas.push(r.total_num || 0);
                }
            })
            let _max = Math.max(..._datas);
            console.log('_max', _max)
            // var colorList = [
            //     "#39B3FF",
            //     "#47E0E0",
            //     "#7891D9",
            //     "#83D978",
            //     "#C7A530",
            //     "#FF8439",
            // ];
            var colorList = [
                [ 'rgba(72, 169, 248, 1)', 'rgba(45, 144, 218, 1)' ],
                [ 'rgba(192, 0, 0, 1)', 'rgba(252, 85, 85, 1)' ],
                [ 'rgba(72, 169, 248, 1)', 'rgba(45, 144, 218, 1)' ],
                [ 'rgba(192, 0, 0, 1)', 'rgba(252, 85, 85, 1)' ],
                [ 'rgba(72, 169, 248, 1)', 'rgba(45, 144, 218, 1)' ],
                [ 'rgba(192, 0, 0, 1)', 'rgba(252, 85, 85, 1)' ],
            ];
            var titleColorList = [
                '#C00000',
                '#00C7D7',
                '#2D90DA',
                '#088EA7',
                '#054ED4',
            ];
            var defaultData = [100, 100, 100, 100, 100];
            let _option = {
                grid: {
                    left: "5%",
                    right: "5%",
                    bottom: "0%",
                    top: "5%",
                    containLabel: true,
                },
                tooltip: {
                    trigger: "axis",
                    axisPointer: {
                        type: "none",
                    },
                    formatter: function (params) {
                        return (
                            params[0].name +
                            "<br/>" +
                            "<span style='display:inline-block;margin-right:5px;border-radius:10px;width:9px;height:9px;background-color:rgba(36,207,233,0.9)'></span>" +
                            // params[0].seriesName + ' : ' + Number((params[0].value.toFixed(4) / 10000).toFixed(2)).toLocaleString() + ' <br/>'
                            params[0].seriesName +
                            " : " +
                            params[0].value
                        );
                    },
                },
                xAxis: {
                    show: false,
                    type: "value",
                    max: 100 * 1.02,
                },
                yAxis: [
                    {
                        type: "category",
                        inverse: true,
                        // axisLabel: {
                        //     show: true,
                        //     padding: [ 0, 0, 100, 0 ],
                        //     textStyle: {
                        //         color: '#fff'
                        //     },
                        // },
                        axisLabel: {
                            verticalAlign: "bottom",
                            // align: 'left',
                            padding: [0, 0, -9, 10], //文字与柱状图的距离

                            formatter: function (value, index) {
                                var num = "";
                                var str = "";
                                let no = "NO.";
                                num = index + 1;
                                if (index === 0) {
                                    str =
                                        "{no1|" +
                                        no +
                                        " " +
                                        num +
                                        "} " +
                                        " {title1|" +
                                        value +
                                        "}";
                                } else if (index === 1) {
                                    str =
                                        "{no2|" +
                                        no +
                                        " " +
                                        num +
                                        "} " +
                                        " {title2|" +
                                        value +
                                        "}";
                                } else if (index === 2) {
                                    str =
                                        "{no3|" +
                                        no +
                                        " " +
                                        num +
                                        "} " +
                                        " {title3|" +
                                        value +
                                        "}";
                                } else if (index === 3) {
                                    str =
                                        "{no4|" +
                                        no +
                                        " " +
                                        num +
                                        "} " +
                                        " {title3|" +
                                        value +
                                        "}";
                                } else if (index === 4) {
                                    str =
                                        "{no5|" +
                                        no +
                                        " " +
                                        num +
                                        "} " +
                                        " {title3|" +
                                        value +
                                        "}";
                                } else {
                                    str =
                                        "{no|" +
                                        no +
                                        " " +
                                        num +
                                        "} " +
                                        " {title|" +
                                        value +
                                        "}";
                                }
                                return str;
                            },
                            rich: {
                                no: {
                                    color: "#ffcccc",
                                    fontSize: 10,
                                },
                                no1: {
                                    color: "#C00000",
                                    fontSize: 10,
                                },
                                no2: {
                                    color: "#00C7D7",
                                    fontSize: 10,
                                },
                                no3: {
                                    color: "#2D90DA",
                                    fontSize: 10,
                                },
                                no4: {
                                    color: "#088EA7",
                                    fontSize: 10,
                                },
                                no5: {
                                    color: "#054ED4",
                                    fontSize: 10,
                                },
                                num: {
                                    color: "#fff",
                                    backgroundColor: "#ffcccc",
                                    width: 20,
                                    height: 20,
                                    fontSize: 10,
                                    align: "center",
                                    borderRadius: 100,
                                },
                                title: {
                                    fontSize: 10,
                                    color: "#fff",
                                },
                                title1: {
                                    fontSize: 10,
                                    color: "#ffffff",
                                },
                                title2: {
                                    fontSize: 10,
                                    color: "#fff",
                                },
                                title3: {
                                    fontSize: 10,
                                    color: "#fff",
                                },
                            },
                        },
                        splitLine: {
                            show: false,
                        },
                        axisTick: {
                            show: false,
                        },
                        axisLine: {
                            show: false,
                        },
                        data: _citys,
                    },
                    {
                        type: "category",
                        inverse: true,
                        axisTick: "none",
                        axisLine: "none",
                        show: true,
                        axisLabel: {
                            verticalAlign: "bottom",
                            // align: 'left',
                            padding: [0, 0, -10, 10], //文字与柱状图的距离
                            textStyle: {
                                color: "#ffffff",
                                fontSize: "10",
                            },
                            formatter: function (value) {
                                return value + " ";
                            },
                        },
                        data: _datas,
                    },
                ],
                series: [
                    {
                        name: "背景",
                        tooltip: {
                            show: false
                        },
                        type: "bar",
                        barWidth: 14,
                        barGap: "-80%",
                        data: defaultData.map((m) => m * 1.02),
                        itemStyle: {
                            normal: {
                                color: "rgba(35, 55, 79, 0.8)",
                                barBorderRadius: 0,
                            },
                        },
                    },
                    // 间隔
                    {
                        type: "bar",
                        tooltip: {
                            show: false
                        },
                        barWidth: "8px",
                        stack: "total",
                        label: {
                            normal: {
                                show: false,
                            },
                        },
                        itemStyle: {
                            normal: {
                                color: "transparent", //每个数据的颜色
                            },
                        },
                        data: [1, 1, 1, 1, 1, 1],
                    },
                    {
                        name: "件数",
                        type: "bar",
                        stack: "total",
                        zlevel: 1,
                        itemStyle: {
                            normal: {
                                barBorderRadius: 5,
                                // color: new Echarts.graphic.LinearGradient(
                                //     0,
                                //     0,
                                //     1,
                                //     0,
                                //     [
                                //         {
                                //             offset: 0,
                                //             color: colorList[params.dataIndex][0],
                                //         },
                                //         {
                                //             offset: 1,
                                //             color: colorList[params.dataIndex][1],
                                //         },
                                //     ]
                                // ),
                                color: (params) => {
                                	return new Echarts.graphic.LinearGradient(
                                        0,
                                        0,
                                        1,
                                        0,
                                        [
                                            {
                                                offset: 0,
                                                color: colorList[params.dataIndex][0],
                                            },
                                            {
                                                offset: 1,
                                                color: colorList[params.dataIndex][1],
                                            },
                                        ]
                                    )
                                }
                            },
                        },
                        barWidth: 6,
                        data: _datas,
                    },
                    // // 间隔
                    // {
                    //     type: "bar",
                    //     tooltip: {
                    //         show: false
                    //     },
                    //     barWidth: "5px",
                    //     stack: "total",
                    //     label: {
                    //         normal: {
                    //             show: false,
                    //         },
                    //     },
                    //     itemStyle: {
                    //         normal: {
                    //             color: "transparent", //每个数据的颜色
                    //         },
                    //     },
                    //     data: [1, 1, 1, 1, 1, 1],
                    // },
                ],
            };
            // 传入数据
            echartRef.setOption(_option);
        },
    },
};
</script>

<style lang="scss" scoped>
.left-chart-three-component {
    z-index: 1;
    height: 100%;
    width: 100%;
    .chart {
        height: 100%;
        width: 100%;
    }
}
</style>
