const state = {
    // 活动状态
    activityStatus: {
        0: '进行中',
        1: '待开始',
        2: '已结束'
    },
    // 结算状态
    settlementStatus: {
        0: '未结算',
        1: '已部分付款',
        2: '已全部付款'
    },
    // 部门状态
    deptStatus: {
        0: '正常',
        1: '停用',
    },
    // 启停状态
    enableStatus: {
        0: '正常',
        1: '停用',
    },
    // 启停状态
    enable1Status: {
        0: '启用',
        1: '禁用',
    },
    // 性别
    sex: {
        0: '女',
        1: '男',
        2: '未知',
    },
    // 角色类型
    roleType: {
        0: '系统内置角色',
        1: '自定义角色',
    },
    // 所属终端
    terminal: {
        '-1': '平台端',
        1: '机构端',
        2: '教育局端',
        3: '学校端',
    },
    // 菜单类型
    menuType: {
        'M': '平台目录端',
        'C': '菜单',
        'F': '按钮'
    },
    // 教育局等级
    moeLevel: {
        '1': '省教育厅',
        '2': '市教育局',
        '3': '区/县教育局',
    },
    // 教育局等级
    logOperatorType: {
        '1': '新增',
        '2': '修改',
        '3': '删除',
        '4': '授权',
        '5': '导出',
        '6': '导入',
        '7': '强退',
        '8': '生成代码',
        '9': '清空数据'
    },
    // 产品类型
    productType: {
        '1': '基础产品',
        '2': '组合产品',
    },
    // 产品状态
    productApproveStatus: {
        '0': '待审核',
        '1': '通过',
        '2': '拒绝',
    },
    // 支付状态
    payStatus: {
        '0': '待支付',
        '1': '支付成功',
        '2': '支付失败',
        '3': '退款中',
        '4': '已部分退款',
        '5': '已全额退款',
    },
    payStatus1: {
        0: '待支付',
        1: '支付成功',
        2: '支付失败',
        3: '退款中',
        4: '已部分退款',
        5: '已全额退款',
    },
    // 紧急事件状态
    emergencyLevel: {
        '0': '一般',
        '1': '较重',
        '2': '严重',
    },
    // 紧急事件状态
    emergencyStatus: {
        '0': '已提交',
        '1': '已处理',
    },
    // 紧急事件启动预案
    emergencyRunPlan: {
        '0': '启动',
        '1': '不启动',
        '-1': '-',
    },
    // 家属关系
    relationship: {
        // '0': '父亲',
        '1': '父女',
        '2': '父子',
        '3': '母女',
        '4': '母子',
        1: '父女',
        2: '父子',
        3: '母女',
        4: '母子',
    },
    // 条款类型
    clauseType: {
        '0': '用户使用协议',
        '1': '机构使用协议',
        '2': '教育局使用协议',
        '3': '应急管理办法',
        '4': '未成年人监护方案',
        '5': '保险方案',
        '6': '注意事项',
        '7': '补充说明',
    },
    // 审批状态
    approveStatus: {
        0: '待审核',
        1: '通过',
        2: '拒绝'
    },
    // 政策下发类型
    policyType: {
        1: '发送至辖区学校',
        2: '发送至辖区教育局'
    },
    // 政策下发类型2
    policyType2: {
        0: '未下发',
        1: '发送至辖区学校',
        2: '发送至辖区教育局'
    },
    // 中标状态
    inviteBidsStatus: {
        0: '待开始',
        1: '进行中',
        2: '已结束'
    },
    // 中标状态
    inviteBidsStatus1: {
        0: '进行中',
        1: '已中标',
        2: '未中标'
    },
    // 审批流程类型
    approveFlowType: {
        // 1: '研学产品审核',
        2: '活动申报审批',
        3: '行后资料审批',
        // 4: '机构资质审批',
        5: '机构资料申报'
    },
    // 审批流程状态
    approveStatus: {
        0: '审批中',
        1: '已完成',
        2: '驳回'
    },
    // 审批流程进度
    approveProgress: {
        0: '待我审批',
        1: '我已审批',
    },
    // 是否上传过成果
    isUpload: {
        0: '未上传',
        1: '已上传',
    },
    // 审批状态
    activityApproveRes: {
        1: '待审核',
        2: '通过',
        3: '拒绝'
    },
    // 审批状态
    bidEdStatus: {
        1: '可投标',
        2: '不可投标',
    },
    refundStatus:{
        0:'退款中',
        1:'退款成功',
        2:'退款失败'
    }
    // 审批状态
    // orgBidEdStatus: {
    //     0: '进行中',
    //     1: '已中标',
    //     2: '未中标',
    // },
}

const getters = {
}

const actions = {
}

const mutations = {
}

export default {
    namespaced: true,
    state,
    actions,
    getters,
    mutations
}
